// src/pages/policies.tsx

"use client";
import React from "react";

const Policies = () => {
  return (
    <div className="container mx-auto p-4">
      <h1 className="text-3xl font-bold mb-4">
        Политика за поверителност и Условия за ползване
      </h1>

      <section className="mb-8">
        <h2 className="text-2xl font-semibold mt-6 mb-4">
          Политика за поверителност
        </h2>

        <p>Последно обновено: 04/14/2025</p>

        <p>
          Добре дошли в Realtime Score! Ние приемаме вашата поверителност на
          сериозно. Тази политика за поверителност обяснява как събираме,
          използваме и защитаваме вашата лична информация.
        </p>

        <h3 className="text-xl font-semibold mt-4">
          1. Информация, която събираме
        </h3>
        <ul className="list-disc pl-5 mb-6">
          <li>
            <strong>Лична информация</strong>: Име, имейл адрес и контактни
            данни.
          </li>
          <li>
            <strong>Данни за използване</strong>: Информация за това как
            използвате нашето приложение, включително вашия IP адрес, тип
            браузър и модели на използване.
          </li>
          <li>
            <strong>Бисквитки</strong>: Използваме бисквитки за подобряване на
            потребителското изживяване. Можете да изключите бисквитките чрез
            настройките на вашия браузър, но това може да повлияе на
            способността ви да използвате определени функции на нашето
            приложение.
          </li>
        </ul>

        <h3 className="text-xl font-semibold mt-4">
          2. Как използваме вашата информация
        </h3>
        <ul className="list-disc pl-5 mb-6">
          <li>Да предоставяме и поддържаме нашата услуга.</li>
          <li>Да ви уведомяваме за промени в нашата услуга.</li>
          <li>Да предоставяме клиентска поддръжка.</li>
          <li>Да анализираме използването за подобряване на нашата услуга.</li>
        </ul>

        <h3 className="text-xl font-semibold mt-4">3. Сигурност на данните</h3>
        <p>
          Ние прилагаме здрави мерки за сигурност, за да защитим вашите данни.
          Въпреки това, моля, обърнете внимание, че няма метод за предаване на
          данни през интернет или електронно съхранение, който е напълно
          сигурен.
        </p>

        <h3 className="text-xl font-semibold mt-4">
          4. Споделяне на вашата информация
        </h3>
        <p>
          Ние не продаваме или споделяме вашата лична информация с трети страни,
          освен ако това е необходимо за предоставяне на нашите услуги или за
          изпълнение на законовите задължения.
        </p>

        <h3 className="text-xl font-semibold mt-4">5. Вашите права</h3>
        <p>
          Имате право да получите достъп, актуализирате или изтриете вашата
          лична информация.
        </p>

        <h3 className="text-xl font-semibold mt-4">
          6. Промени в тази политика
        </h3>
        <p>
          Може да актуализираме тази политика за поверителност от време на
          време. Ще ви уведомим за всички промени, като публикуваме новата
          политика на тази страница.
        </p>

        <h3 className="text-xl font-semibold mt-4">Свържете се с нас</h3>
        <p>
          Ако имате въпроси относно тази политика за поверителност, моля,
          свържете се с нас на realtimescore@gmail.com.
        </p>
      </section>

      <section>
        <h2 className="text-2xl font-semibold mt-6 mb-4">
          Условия за ползване
        </h2>

        <p>Последно обновено: 20.04.2025</p>

        <p>
          Добре дошли в Realtime Score! Използвайки нашата услуга, вие се
          съгласявате да се съобразите с и да бъдете обвързани от следните
          условия и правила.
        </p>

        <h3 className="text-xl font-semibold mt-4">1. Приемане на условията</h3>
        <p>
          Достъпвайки и използвайки Realtime Score, вие приемате и се
          съгласявате да бъдете обвързани от тези условия за ползване и нашата
          политика за поверителност.
        </p>

        <h3 className="text-xl font-semibold mt-4">
          2. Използване на услугата
        </h3>
        <p>
          Вие се съгласявате да използвате нашата услуга само за законни цели и
          в съответствие с тези условия. Вие не трябва:
        </p>
        <ul className="list-disc pl-5 mb-6">
          <li>Да нарушавате приложимите закони и регулации.</li>
          <li>Да използвате услугата за неразрешени или незаконни дейности.</li>
          <li>Да пречите на работата или сигурността на услугата.</li>
        </ul>

        <h3 className="text-xl font-semibold mt-4">3. Потребителски акаунти</h3>
        <p>
          За да използвате определени функции на нашата услуга, може да се
          наложи да създадете акаунт. Трябва да предоставите точна и пълна
          информация и да запазите сигурността на вашите акаунтни данни. Вие сте
          отговорни за всички действия, извършени под вашия акаунт.
        </p>

        <h3 className="text-xl font-semibold mt-4">
          4. Интелектуална собственост
        </h3>
        <p>
          Всички съдържания, търговски марки и други права на интелектуална
          собственост на нашата услуга са собственост на Realtime Score или
          нейните лицензодатели. Вие не можете да използвате, копирате или
          разпространявате никакво съдържание без нашето разрешение.
        </p>

        <h3 className="text-xl font-semibold mt-4">
          5. Ограничаване на отговорността
        </h3>
        <p>
          В най-широкия смисъл, позволен от закона, Realtime Score не носи
          отговорност за никакви косвени, случайни или последващи щети,
          произтичащи от или във връзка с вашето използване на услугата.
        </p>

        <h3 className="text-xl font-semibold mt-4">6. Прекратяване</h3>
        <p>
          Ние си запазваме правото да прекратим или спрем вашия достъп до
          услугата по наше усмотрение, без предизвестие, за поведение, което
          смятаме за нарушаващо тези условия или вредно за други потребители.
        </p>

        <h3 className="text-xl font-semibold mt-4">7. Приложимо право</h3>
        <p>
          Тези условия се управляват и тълкуват в съответствие със законите на
          Република България, без оглед на неговите конфликти на правни
          разпоредби.
        </p>

        <h3 className="text-xl font-semibold mt-4">8. Промени в условията</h3>
        <p>
          Можем да актуализираме тези условия от време на време. Ще ви уведомим
          за всички промени, като публикуваме новите условия на тази страница.
        </p>

        <h3 className="text-xl font-semibold mt-4">Свържете се с нас</h3>
        <p>
          Ако имате въпроси относно тези условия за ползване, моля, свържете се
          с нас на realtimescore@gmail.com.
        </p>
      </section>
    </div>
  );
};

export default Policies;
